Repository: 0xs4yk/GameShell
Catalog: i18n/*.po
Languages: fr

source: START OF COMMANDS HISTORY
fr: DÉBUT DE L'HISTORIQUE DES COMMANDES

source: Error: couldn't get mission number $MISSION_NB (from $fn_name)
fr: Error : mission '$MISSION_NB' introuvable (dans $fn_name)

source: Error: the command 'gsh reset' shouldn't be run inside a subshell!
fr: Erreur : la commande 'gsh reset' ne devrait pas être lancée dans un sous-shell !

source: Error: the command 'gsh hardreset' shouldn't be run inside a subshell!
fr: Erreur : la commande 'gsh hardreset' ne devrait pas être lancée dans un sous-shell !

source: There are stopped jobs in your session. Those processes will be terminated. You can get the list of those jobs with $ jobs Do you still want to quit? [y/n]
fr: Il y a des processus stoppés dans votre session. Ces processus vont être arêtés. Vous pouvez obtenir la liste de ces processus avec $ jobs Êtes vous sûr de vouloir quitter ? [o/N]

source: y
fr: o

source: Press Enter to continue.
fr: Appuyez sur Entrée pour continuer.

source: Error: mission $MISSION_NB doesn't exist!
fr: Erreur : la mission $MISSION_NB n'existe pas !

source: Error: no mission was found! Aborting.
fr: Erreur : aucune mission trouvée ! Abandon.

source: Error: mission $MISSION_NB is cancelled because some dependencies are not met.
fr: Erreur : la mission $MISSION_NB est annulée car des dépendances ne sont pas satisfaites.

source: Warning: this mission was initialized in a subshell. Run the command $ gsh reset to make sure the mission is initialized properly.
fr: Attention : cette mission a été initialisée dans un sous-shell. Lancez la commande $ gsh reset pour qu'elle soit initialisée correctement.

source: $GSH_ROOT/i18n/gameshell-init-msg/en.txt
fr: $GSH_ROOT/i18n/gameshell-init-msg/fr.txt

source: $GSH_ROOT/i18n/gameshell-init-msg-short/en.txt
fr: $GSH_ROOT/i18n/gameshell-init-msg-short/fr.txt

source: Mission $MISSION_NB has been cancelled.
fr: La mission $MISSION_NB a été annulée

source: Error: mission $MISSION_NB doesn't have an auto script.
fr: Erreur : la mission $MISSION_NB n'a pas de script automatique.

source: Congratulations, mission $MISSION_NB has been successfully completed!
fr: Bravo, vous avez réussi la mission $MISSION_NB !

source: $MISSION_DIR/treasure-msg/en.txt
fr: $MISSION_DIR/treasure-msg/fr.txt

source: Warning: the file 'treasure.sh' was sourced from a subshell. You should use the command $ gsh reset
fr: Attention : le fichier 'treasure.sh' a été chargé dans un sous-shell. Vous devriez lancer la commande $ gsh reset

source: Sorry, mission $MISSION_NB hasn't been completed.
fr: Désolé, la mission $MISSION_NB a échoué.

source: Error: _gsh_assert_check only accept 'true' and 'false' as argument.
fr: Erreur : _gsh_assert_check n'accepte que true' et 'false' comme argument.

source: test $nb_tests failed
fr: test $nb_tests échoué

source: Error: mission $MISSION_NB doesn't have a test script.
fr: Erreur : la mission $MISSION_NB n'a pas de script de test.

source: $nb_tests successful tests
fr: $nb_tests tests passés avec succès

source: $nb_failed_tests failures out of $nb_tests tests
fr: $nb_failed_tests échecs sur $nb_tests tests

source: Error: the 'goto' command requires a mission number as argument.
fr: Erreur : la commande 'goto' a besoin d'un numéro de mission en argument.

source: Error: unknown gsh command '$cmd'. Use one of the following commands:
fr: Erreur : command gsh inconnue '$cmd'. Utilisez une des commandes suivantes :

source: $GSH_ROOT/i18n/gameshell-HELP/en.txt
fr: $GSH_ROOT/i18n/gameshell-HELP/fr.txt

source: $MISSION_DIR/goal/en.txt
fr: $MISSION_DIR/goal/fr.txt

source: $GSH_ROOT/i18n/gameshell-help/en.txt
fr: $GSH_ROOT/i18n/gameshell-help/fr.txt

source: completed
fr: réussie

source: failed
fr: échouée

source: skipped
fr: sautée

source: cancelled
fr: annulée

source: days
fr: jours

source: total time: %s
fr: temps total : %s

source: game time: %s in %d session
fr: temps de jeu : %s en %d session

source: %d mission passed using the auto.sh script:
fr: %d mission réussie en utilisant le script auto.sh :

source: %d mission passed:
fr: %d mission réussie :

source: %d mission skipped:
fr: %d mission réussie :

source: %d mission cancelled for missing dependencies:
fr: %d mission annulée pour cause de dépendances :

source: %d authentification failure
fr: %d échec d'authentification

source: $GSH_ROOT/i18n/gameshell-welcome/en.txt
fr: $GSH_ROOT/i18n/gameshell-welcome/fr.txt

source: Error: you are not allowed to run this command.
fr: Erreur : vous n'avez pas le droit d'exécuter cette commande.

source: password:
fr: mot de passe :

source: Error: wrong password.
fr: Erreur : mauvais mot de passe.

source: AUTOMATICALLY GENERATED ON STARTUP -- DO NOT MODIFY
fr: AUTOMATIQUEMENT GÉNÉRÉ AU DÉMARRAGE -- NE PAS MODIFIER

source: [Press space to continue, q to quit\.]
fr: [Appuyer sur la barre d'espace pour continuer, 'q' pour quitter\.]

source: While you are waiting, a bat flies by...
fr: Pendant que vous attendez, une chauve-souris passe...

source: While you are waiting, a snake slithers by...
fr: Pendant que vous attendez, une serpent passe...

source: While you are waiting, a caterpillar crawls by...
fr: Pendant que vous attendez, une chenille passe...

source: While you are waiting, a snail goes by...
fr: Pendant que vous attendez, un escargot passe...

source: While you are waiting, a spider crawls by...
fr: Pendant que vous attendez, une araignée passe...

source: While you are waiting, a duck swims by...
fr: Pendant que vous attendez, un canard passe...

source: While you are waiting, you see a fish swimming in circles...
fr: Pendant que vous attendez, un poisson fait des ronds...

source: While you are waiting, a centipede crawls by...
fr: Pendant que vous attendez, un mille pates passe...

source: While you are waiting, an ant crawls by...
fr: Pendant que vous attendez, une fourmi passe...

source: While you are waiting, a fish swims by...
fr: Pendant que vous attendez, un poisson passe...

source: While you are waiting, a large fish swims by...
fr: Pendant que vous attendez, un gros poisson passe...

source: $GSH_ROOT/i18n/start-help/en.txt
fr: $GSH_ROOT/i18n/start-help/fr.txt

source: Error: this option is only available from an executable archive!
fr: Erreur : cette option n'est disponible que depuis une archive exécutable !

source: Error: invalid option: '-$OPTARG'
fr: Erreur : option invalide: '-$OPTARG'

source: Player's name:
fr: Nom du joueur :

source: Player's email:
fr: Email du joueur :

source: Is this information correct? [Y/n]
fr: Est-ce que ces informations sont correctes ? [O/n]

source: Y
fr: O

source: The directory $GSH_CONFIG contains meta-data from a previous game. Do you want to remove it and start a new game? [y/N]
fr: Le répertoire $GSH_CONFIG contient des méta-données provenant d'une partie précédente. Voulez vous les supprimer et commencer une nouvelle partie ? [o/N]

source: Error: a least one base function is not working properly. Aborting!
fr: Erreur : au moins une fonction de base ne marche pas correctement. Abandon.

source: Error: unknown shell '$SHELL'. Use option -B to use bash, and option -Z to use zsh.
fr: Erreur : shell inconnu '$SHELL'. Utilisez l'option -B utiliser bash, et l'option -Z pour utiliser zsh.
