Repository: 0xs4yk/GameShell
Catalog: missions/10_cp_2/locale/*.po
Languages: fr

source: $GASH_TMP/dans_entree
fr: $GASH_TMP/in_entrance

source: $GASH_HOME/Castle/Entrance
fr: $GASH_HOME/Chateau/Entree

source: You have changed the contents of the entrance!
fr: Vous avez changé le contenu de l'entrée !

source: $GASH_HUT
fr: $GASH_CABANE

source: Where is the hut???
fr: Où est la cabane ???

source: hay
fr: foin

source: gravel
fr: gravas

source: I wanted only the ornements of the entrance!
fr: Je ne voulais que les ornements de l'entrée !

source: I wanted all the entrance ornements!
fr: Je voulais tous les ornements de l'entrée !

source: $GASH_HOME/Forest/Hut
fr: $GASH_HOME/Foret/Cabane

source: $MISSION_DIR/goal/en.txt
fr: $MISSION_DIR/goal/fr.txt
